Revit 2027 API
ParameterTypeId.RbsElecDistributionNodeSupplyFrom Property
 "Supply From"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecDistributionNodeSupplyFrom { get; }
Public Shared ReadOnly Property RbsElecDistributionNodeSupplyFrom As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecDistributionNodeSupplyFrom {
	ForgeTypeId^ get ();
}
static member RbsElecDistributionNodeSupplyFrom : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace